# StairsSupportUpperEndCut Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsSupportUpperEndCut Property
ParameterTypeId Class See Also
---
"Upper End Cut": Upper End Cut
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsSupportUpperEndCut { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsSupportUpperEndCut As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsSupportUpperEndCut {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace